In [2]:
import numpy as np
import pandas as pd

In [3]:
obj = pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj.dtype

dtype('int64')

In [9]:
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
sdata = {"Charles":35000,"Kilho":71000,"Hayoung":16000,"Sangjae":50000}
obj3= pd.Series(sdata)

In [14]:
obj3

Charles    35000
Hayoung    16000
Kilho      71000
Sangjae    50000
dtype: int64

In [16]:
obj3.name = "Salary"
obj3.index.name = "names"

In [17]:
obj3

names
Charles    35000
Hayoung    16000
Kilho      71000
Sangjae    50000
Name: Salary, dtype: int64

In [19]:
obj3.index = ['A','B','C','D']

In [20]:
obj3

A    35000
B    16000
C    71000
D    50000
Name: Salary, dtype: int64

In [22]:
data = {"name": ["kilho","kilho","kilho","Charles","Charles"],
        "year": [2014,2015,2016,2015,2016],
        "points": [1.5,1.7,3.6,2.4,2.9]
       }
df = pd.DataFrame(data)

In [23]:
df

      name  points  year
0    kilho     1.5  2014
1    kilho     1.7  2015
2    kilho     3.6  2016
3  Charles     2.4  2015
4  Charles     2.9  2016

In [24]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [25]:
df.columns

Index(['name', 'points', 'year'], dtype='object')

In [26]:
df.values

array([['kilho', 1.5, 2014],
       ['kilho', 1.7, 2015],
       ['kilho', 3.6, 2016],
       ['Charles', 2.4, 2015],
       ['Charles', 2.9, 2016]], dtype=object)

In [27]:
df.index.name= "num"
df.columns.name = "Info"

In [28]:
df

Info     name  points  year
num
0       kilho     1.5  2014
1       kilho     1.7  2015
2       kilho     3.6  2016
3     Charles     2.4  2015
4     Charles     2.9  2016

In [32]:
df2 = pd.DataFrame(data, columns=["year","name","points","panalty"],
                        index=["one","two","three","four","five"])

In [33]:
df2

       year     name  points panalty
one    2014    kilho     1.5     NaN
two    2015    kilho     1.7     NaN
three  2016    kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [34]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [36]:
df2.columns

Index(['year', 'name', 'points', 'panalty'], dtype='object')

In [37]:
df2.values

array([[2014, 'kilho', 1.5, nan],
       [2015, 'kilho', 1.7, nan],
       [2016, 'kilho', 3.6, nan],
       [2015, 'Charles', 2.4, nan],
       [2016, 'Charles', 2.9, nan]], dtype=object)

In [38]:
df2.describe()

             year    points
count     5.00000  5.000000
mean   2015.20000  2.420000
std       0.83666  0.864292
min    2014.00000  1.500000
25%    2015.00000  1.700000
50%    2015.00000  2.400000
75%    2016.00000  2.900000
max    2016.00000  3.600000